{
  "common": {
    "name": "node-red",
    "version": "3.1.0",
    "title": "node-red",
    "titleLang": {
      "en": "node-red",
      "de": "node-red",
      "ru": "node-red",
      "pt": "node-red",
      "nl": "node-red",
      "fr": "node-red",
      "it": "node-red",
      "es": "node-red",
      "pl": "node-red",
      "zh-cn": "node-red"
    },
    "news": {
      "3.1.0": {
        "en": "Added new parameter \"httpNodeRoot\" as httpRoot has been replaced by httpAdminRoot in version 3.0.0.\nAdjust description of RBE cases for In-Node to match Filter node",
        "de": "Neuer Parameter \"httpNodeRoot\" hinzugefügt, da httpRoot in Version 3.0.0 durch httpAdminRoot ersetzt wurde.\nPassen Sie die Beschreibung der RBE-Fälle für den In-Node an den Filter-Node an",
        "ru": "Добавлен новый параметр «httpNodeRoot», так как httpRoot был заменен на httpAdminRoot в версии 3.0.0.\nНастройте описание вариантов RBE для In-Node, чтобы оно соответствовало узлу Filter.",
        "pt": "Adicionado novo parâmetro \"httpNodeRoot\" pois httpRoot foi substituído por httpAdminRoot na versão 3.0.0.\nAjustar a descrição dos casos RBE para In-Node para corresponder ao nó Filter",
        "nl": "Nieuwe parameter \"httpNodeRoot\" toegevoegd omdat httpRoot is vervangen door httpAdminRoot in versie 3.0.0.\nPas de beschrijving van RBE-gevallen voor In-Node aan om overeen te komen met Filterknooppunt",
        "fr": "Ajout du nouveau paramètre \"httpNodeRoot\" car httpRoot a été remplacé par httpAdminRoot dans la version 3.0.0.\nAjuster la description des cas RBE pour In-Node afin qu'elle corresponde au nœud Filter",
        "it": "Aggiunto nuovo parametro \"httpNodeRoot\" poiché httpRoot è stato sostituito da httpAdminRoot nella versione 3.0.0.\nRegola la descrizione dei casi RBE per In-Node in modo che corrisponda al nodo Filtro",
        "es": "Se agregó el nuevo parámetro \"httpNodeRoot\", ya que httpRoot se reemplazó por httpAdminRoot en la versión 3.0.0.\nAjuste la descripción de los casos de RBE para In-Node para que coincida con el nodo de filtro",
        "pl": "Dodano nowy parametr \"httpNodeRoot\", ponieważ httpRoot został zastąpiony przez httpAdminRoot w wersji 3.0.0.\nDostosuj opis przypadków RBE dla In-Node, aby pasował do węzła filtra",
        "zh-cn": "添加了新参数“httpNodeRoot”，因为 httpRoot 在 3.0.0 版本中已被 httpAdminRoot 替换。\n调整 In-Node 的 RBE 案例描述以匹配 Filter 节点"
      },
      "3.0.1": {
        "en": "added option for in Node to choose topic format (MQTT with / or ioBroker with .). Default: MQTT\n",
        "de": "Option für in Node hinzugefügt, um das Themenformat auszuwählen (MQTT mit / oder ioBroker mit .). Standard: MQTT\n",
        "ru": "добавлена возможность в Node выбирать формат темы (MQTT с / или ioBroker с .). По умолчанию: MQTT\n",
        "pt": "adicionada opção para no Node escolher o formato do tópico (MQTT com / ou ioBroker com .). Padrão: MQTT\n",
        "nl": "optie toegevoegd om in Node een onderwerpformaat te kiezen (MQTT met / of ioBroker met .). Standaard: MQTT\n",
        "fr": "ajout d'une option dans Node pour choisir le format de sujet (MQTT avec / ou ioBroker avec .). Par défaut : MQTT\n",
        "it": "aggiunta opzione per in Node per scegliere il formato dell'argomento (MQTT con / o ioBroker con .). Predefinito: MQTT\n",
        "es": "Opción agregada para que en Node elija el formato del tema (MQTT con / o ioBroker con .). Valor predeterminado: MQTT\n",
        "pl": "dodano opcję w Node, aby wybrać format tematu (MQTT z / lub ioBroker z .). Domyślnie: MQTT\n",
        "zh-cn": "在 Node 中添加了选项以选择主题格式（MQTT with / 或 ioBroker with .）。默认值：MQTT\n"
      },
      "3.0.0": {
        "en": "IMPORTANT: Node-RED is now v2. Please check your nodes for compatibility! See also https://nodered.org/blog/2021/07/20/version-2-0-released and https://nodered.org/blog/2021/10/21/version-2-1-released\nNode-RED updated to 2.2.2\nmany other changes, see Changelog!",
        "de": "WICHTIG: Node-RED ist jetzt v2. Bitte überprüfen Sie Ihre Nodes auf Kompatibilität! Siehe auch https://nodered.org/blog/2021/07/20/version-2-0-released und https://nodered.org/blog/2021/10/21/version-2-1-released\nNode-RED aktualisiert auf 2.2.2\nviele weitere Änderungen, siehe Changelog!",
        "ru": "ВАЖНО: Node-RED теперь v2. Пожалуйста, проверьте ваши узлы на совместимость! См. также https://nodered.org/blog/2021/07/20/version-2-0-released и https://nodered.org/blog/2021/10/21/version-2-1-released.\nNode-RED обновлен до версии 2.2.2\nмногие другие изменения, смотрите журнал изменений!",
        "pt": "IMPORTANTE: Node-RED agora é v2. Verifique a compatibilidade de seus nós! Veja também https://nodered.org/blog/2021/07/20/version-2-0-released e https://nodered.org/blog/2021/10/21/version-2-1-released\nNode-RED atualizado para 2.2.2\nmuitas outras mudanças, veja Changelog!",
        "nl": "BELANGRIJK: Node-RED is nu v2. Controleer uw nodes op compatibiliteit! Zie ook https://nodered.org/blog/2021/07/20/version-2-0-released en https://nodered.org/blog/2021/10/21/version-2-1-released\nNode-RED bijgewerkt naar 2.2.2\nvele andere wijzigingen, zie Changelog!",
        "fr": "IMPORTANT : Node-RED est maintenant v2. Veuillez vérifier la compatibilité de vos nœuds ! Voir aussi https://nodered.org/blog/2021/07/20/version-2-0-released et https://nodered.org/blog/2021/10/21/version-2-1-released\nNode-RED mis à jour vers 2.2.2\nbeaucoup d'autres changements, voir Changelog !",
        "it": "IMPORTANTE: Node-RED è ora v2. Controlla la compatibilità dei tuoi nodi! Vedi anche https://nodered.org/blog/2021/07/20/version-2-0-released e https://nodered.org/blog/2021/10/21/version-2-1-released\nNodo-RED aggiornato a 2.2.2\ntante altre modifiche, vedi Changelog!",
        "es": "IMPORTANTE: Node-RED ahora es v2. ¡Compruebe la compatibilidad de sus nodos! Ver también https://nodered.org/blog/2021/07/20/version-2-0-released y https://nodered.org/blog/2021/10/21/version-2-1-released\nNodo-RED actualizado a 2.2.2\nmuchos otros cambios, vea Changelog!",
        "pl": "WAŻNE: Node-RED jest teraz v2. Sprawdź swoje węzły pod kątem kompatybilności! Zobacz także https://nodered.org/blog/2021/07/20/version-2-0-released i https://nodered.org/blog/2021/10/21/version-2-1-released\nNode-RED zaktualizowano do 2.2.2\nwiele innych zmian, zobacz Changelog!",
        "zh-cn": "重要提示：Node-RED 现在是 v2。请检查您的节点是否兼容！另见 https://nodered.org/blog/2021/07/20/version-2-0-released 和 https://nodered.org/blog/2021/10/21/version-2-1-released\nNode-RED 更新到 2.2.2\n许多其他更改，请参阅更改日志！"
      },
      "2.4.1": {
        "en": "Correct min7max for the object creation \nNode-red updated to 1.3.6",
        "de": "Korrektes min7max für die Objekterstellung\nKnotenrot aktualisiert auf 1.3.6",
        "ru": "Правильный min7max для создания объекта\nNode-red обновлен до 1.3.6",
        "pt": "Corrigir min7max para a criação do objeto\nNode-red atualizado para 1.3.6",
        "nl": "Corrigeer min7max voor het maken van objecten\nNode-red bijgewerkt naar 1.3.6",
        "fr": "Corriger min7max pour la création de l'objet\nNode-red mis à jour vers la 1.3.6",
        "it": "Correggere min7max per la creazione dell'oggetto\nNodo rosso aggiornato a 1.3.6",
        "es": "Corregir min7max para la creación del objeto\nNode-red actualizado a 1.3.6",
        "pl": "Popraw min7max dla tworzenia obiektu\nWęzeł czerwony zaktualizowany do 1.3.6",
        "zh-cn": "为对象创建更正 min7max\nNode-red 更新至 1.3.6"
      },
      "2.4.0": {
        "en": "update to node-red 1.3.5\nOptimize for js-controller 3.3\nAdd option to override the default ack flag in the message for OutNode",
        "de": "Update auf Knotenrot 1.3.5\nOptimieren Sie für js-Controller 3.3\nOption zum Überschreiben des Standard-Ack-Flags in der Nachricht für OutNode hinzufügen",
        "ru": "обновление до node-red 1.3.5\nОптимизировать под js-controller 3.3\nДобавить параметр для отмены флага подтверждения по умолчанию в сообщении для OutNode",
        "pt": "atualização para node-red 1.3.5\nOtimize para js-controller 3.3\nAdicionar opção para substituir o sinalizador de confirmação padrão na mensagem para OutNode",
        "nl": "update naar node-red 1.3.5\nOptimaliseren voor js-controller 3.3\nOptie toevoegen om de standaard ack-vlag in het bericht voor OutNode te negeren",
        "fr": "mise à jour vers node-red 1.3.5\nOptimiser pour js-controller 3.3\nAjouter une option pour remplacer l'indicateur d'accusé de réception par défaut dans le message pour OutNode",
        "it": "aggiornamento a node-red 1.3.5\nOttimizza per js-controller 3.3\nAggiungi l'opzione per sovrascrivere il flag di riconoscimento predefinito nel messaggio per OutNode",
        "es": "actualizar a node-red 1.3.5\nOptimizar para js-controller 3.3\nAgregue la opción para anular el indicador de ack predeterminado en el mensaje para OutNode",
        "pl": "aktualizacja do node-red 1.3.5\nOptymalizacja dla kontrolera js 3.3\nDodaj opcję zastąpienia domyślnej flagi potwierdzenia w wiadomości dla OutNode",
        "zh-cn": "更新到节点红色 1.3.5\n针对 js-controller 3.3 优化\n添加选项以覆盖 OutNode 消息中的默认 ack 标志"
      },
      "2.3.0": {
        "en": "BREAKING update from node-red-contrib-aggregator: topic is NOT converted to lowercase anymore!\nupdate to node-red 1.3.2\nAdd done calls to OutNode",
        "de": "BREAKING-Update vom Node-Red-Contrib-Aggregator: Thema wird NICHT mehr in Kleinbuchstaben konvertiert!\nUpdate auf Node-Red 1.3.2\nFügen Sie erledigte Anrufe zu OutNode hinzu",
        "ru": "ПРЕРЫВНОЕ обновление от node-red-contrib-aggregator: тема больше НЕ конвертируется в нижний регистр!\nобновление до node-red 1.3.2\nДобавить выполненные вызовы в OutNode",
        "pt": "QUEBRANDO atualização do node-red-contrib-aggregator: o tópico NÃO é mais convertido para minúsculas!\natualização para node-red 1.3.2\nAdicionar chamadas feitas para OutNode",
        "nl": "BREAKING update van node-red-contrib-aggregator: topic wordt NIET meer geconverteerd naar kleine letters!\nupdate naar node-red 1.3.2\nVoeg voltooide oproepen toe aan OutNode",
        "fr": "BREAKING update de node-red-contrib-aggregator: le sujet n'est plus converti en minuscules!\nmise à jour vers node-red 1.3.2\nAjouter les appels effectués à OutNode",
        "it": "BREAKING aggiornamento da node-red-contrib-aggregator: l'argomento NON è più convertito in minuscolo!\naggiornamento a node-red 1.3.2\nAggiungi chiamate completate a OutNode",
        "es": "BREAKING actualización de node-red-contrib-aggregator: ¡el tema ya NO se convierte a minúsculas!\nactualizar a node-red 1.3.2\nAgregar llamadas realizadas a OutNode",
        "pl": "BREAKING aktualizacja z węzła-red-contrib-Agregator: temat NIE jest już konwertowany na małe litery!\naktualizacja do node-red 1.3.2\nDodaj wykonane wywołania do OutNode",
        "zh-cn": "BREAKING从node-red-contrib-aggregator更新：主题不再转换为小写！\n更新到节点红色1.3.2\n将已完成的呼叫添加到OutNode"
      },
      "2.2.0": {
        "en": "(Apollon77/mickym2) Correct readonly flags. IMPORTANT: Notw Readonly works as it should be. If you worked around the issue before please adjust your nodes!\nFix using wildcards inside the id\nUpdate value on out node trigger \nUpdate to node-red 1.2.9\nAdd triggering in Nodes when delayed initialization on start\nFix list node to support all object types",
        "de": "(Apollon77 / mickym2) Korrigieren Sie schreibgeschützte Flags. WICHTIG: Notw Readonly funktioniert so, wie es sein sollte. Wenn Sie das Problem zuvor umgangen haben, passen Sie bitte Ihre Knoten an!\nBehebung mit Platzhaltern innerhalb der ID\nAktualisieren Sie den Wert beim Auslösen des Knotens\nUpdate auf Node-Red 1.2.9\nFügen Sie Triggering in Nodes hinzu, wenn sich die Initialisierung beim Start verzögert\nFix Listenknoten zur Unterstützung aller Objekttypen",
        "ru": "(Apollon77 / mickym2) Правильные флаги только для чтения. ВАЖНО: Notw Readonly работает должным образом. Если вы пытались решить эту проблему раньше, отрегулируйте узлы!\nИсправить использование подстановочных знаков внутри идентификатора\nОбновить значение триггера выходного узла\nОбновление до node-red 1.2.9\nДобавить срабатывание в узлах при отложенной инициализации при запуске\nИсправить узел списка для поддержки всех типов объектов",
        "pt": "(Apollon77 / mickym2) Sinalizadores somente leitura corretos. IMPORTANTE: Notw Readonly funciona como deveria. Se você contornou o problema antes, ajuste seus nós!\nCorrija o uso de curingas dentro do id\nAtualizar o valor no gatilho do nó\nAtualização para node-red 1.2.9\nAdicionar acionamento em nós quando a inicialização atrasada no início\nCorrigir o nó da lista para suportar todos os tipos de objetos",
        "nl": "(Apollon77 / mickym2) Alleen-lezen vlaggen corrigeren. BELANGRIJK: Notw Readonly werkt zoals het hoort. Als je het probleem eerder hebt omzeild, pas dan je knooppunten aan!\nHerstel het gebruik van jokertekens in de id\nUpdate waarde op uit-knooppunt-trigger\nUpdate naar node-red 1.2.9\nVoeg triggering toe in Nodes bij vertraagde initialisatie bij het starten\nLijstknooppunt repareren om alle objecttypes te ondersteunen",
        "fr": "(Apollon77 / mickym2) Corrigez les indicateurs en lecture seule. IMPORTANT: Notw Readonly fonctionne comme il se doit. Si vous avez déjà résolu le problème, ajustez vos nœuds!\nCorrection en utilisant des caractères génériques dans l'ID\nMettre à jour la valeur sur le déclencheur de nœud\nMise à jour vers node-red 1.2.9\nAjouter le déclenchement dans les nœuds lors de l'initialisation différée au démarrage\nCorrection du nœud de liste pour prendre en charge tous les types d'objets",
        "it": "(Apollon77 / mickym2) Correggere i flag di sola lettura. IMPORTANTE: Notw Readonly funziona come dovrebbe. Se hai risolto il problema prima, regola i tuoi nodi!\nRisolto il problema con l'utilizzo di caratteri jolly all'interno dell'id\nAggiorna il valore al trigger del nodo out\nAggiornamento a node-red 1.2.9\nAggiungere l'attivazione nei nodi quando l'inizializzazione ritardata all'avvio\nCorreggi il nodo dell'elenco per supportare tutti i tipi di oggetto",
        "es": "(Apollon77 / mickym2) Corregir indicadores de solo lectura. IMPORTANTE: Notw Readonly funciona como debería ser. Si solucionó el problema antes, ajuste sus nodos.\nArreglar el uso de comodines dentro de la identificación\nActualizar el valor en el desencadenador de nodo\nActualización a node-red 1.2.9\nAgregue activación en nodos cuando se retrasa la inicialización al inicio\nArreglar el nodo de la lista para admitir todos los tipos de objetos",
        "pl": "(Apollon77 / mickym2) Popraw flagi tylko do odczytu. WAŻNE: Notw Readonly działa tak, jak powinno. Jeśli rozwiązałeś ten problem wcześniej, dostosuj swoje węzły!\nNapraw użycie symboli wieloznacznych w identyfikatorze\nZaktualizuj wartość wyzwalacza z węzła wyjściowego\nZaktualizuj do wersji node-red 1.2.9\nDodaj wyzwalanie w węzłach, gdy opóźniona inicjalizacja przy starcie\nNapraw węzeł listy, aby obsługiwał wszystkie typy obiektów",
        "zh-cn": "（Apollon77 / mickym2）更正只读标志。重要说明：Notw Readonly可以正常工作。如果您之前已解决此问题，请调整节点！\n修复ID内使用通配符的问题\n更新输出节点触发器上的值\n更新到节点红色1.2.9\n启动时延迟初始化时在节点中添加触发\n修复列表节点以支持所有对象类型"
      }
    },
    "desc": {
      "en": "This adapter uses node-red as a service. No additional node-red instance required.",
      "de": "Adapter benutzt node-red als Service. Kein zusätzliches node-red Programm nötig.",
      "ru": "Драйвер создает node-red сервер и позволяет общаться с ним.",
      "pt": "Este adaptador usa node-red como um serviço. Nenhuma instância node-red adicional é necessária.",
      "nl": "Deze adapter gebruikt node-red als een service. Geen extra node-red exemplaar vereist.",
      "fr": "Cet adaptateur utilise node-red en tant que service. Aucune instance node-red supplémentaire requise.",
      "it": "Questo adattatore utilizza node-red come servizio. Nessuna istanza aggiuntiva node-red richiesta.",
      "es": "Este adaptador usa node-red como un servicio. No se requiere ninguna instancia adicional de node-red.",
      "pl": "Ten adapter używa node-red jako usługi. Żadna dodatkowa instancja node-red nie jest wymagana.",
      "zh-cn": "此适配器将node-red作为服务, 不需要额外安装node-red实例."
    },
    "authors": [
      "bluefox <dogafox@gmail.com>"
    ],
    "license": "Apache-2.0",
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "messagebox": true,
    "loglevel": "info",
    "icon": "node-red.png",
    "keywords": [
      "node-red",
      "logic",
      "script"
    ],
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.node-red/master/admin/node-red.png",
    "localLink": "http%s%://%ip%:%port%%httpAdminRoot%",
    "enabled": true,
    "singletonHost": true,
    "supportStopInstance": 3000,
    "unsafePerm": true,
    "materialize": true,
    "compact": true,
    "type": "logic",
    "readme": "https://github.com/ioBroker/ioBroker.node-red/blob/master/README.md",
    "stopBeforeUpdate": true,
    "adminTab": {
      "link": "%protocol%://%ip%:%port%%httpAdminRoot%",
      "fa-icon": "settings_input_composite"
    },
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "tier": 1,
    "connectionType": "local",
    "dataSource": "push"
  },
  "native": {
    "bind": "0.0.0.0",
    "port": 1880,
    "secure": false,
    "certPublic": "",
    "certPrivate": "",
    "httpAdminRoot": "/",
    "hStatic": false,
    "httpStatic": "",
    "npmLibs": "",
    "valueConvert": false,
    "maxMemory": 128,
    "user": "",
    "pass": "",
    "projectsEnabled": false,
    "palletmanagerEnabled": false,
    "allowCreationOfForeignObjects": false,
    "doNotReadObjectsDynamically": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "",
      "type": "channel",
      "common": {
        "name": "States created by node-red.%INSTANCE%",
        "role": "info"
      },
      "native": {}
    }
  ]
}
